{
    "BigPenny": "Vote for BigPenny! He is very good and handsome and isn't afraid of anything! He also has a lot of $THALES and loves the protocol to bits! Some say he has problems comprehending humor in text form but those are just unverified rumors. In fact for German standards he is pretty funny, I guess.\n\nPeople know who I am and what I stand for. Being part of the community and governance (on and off the council) from the start I also know that predicting the future is near impossible in DeFi and thus writing long winded plans is often a futile exercise. So let's keep it simple: My plans are to keep Fee Share for stakers running and to make sure that protocol funds are spent in the most beneficial way for the protocol and our community. Keeping a healthy power balance in Council, always scrutinizing (without distrusting) and never being afraid to speak up. I represent primarily the stakers of the Thales protocol.\n\nIf you like me and/or what I do your vote is much appreciated!\n\nbigpenny.eth",
    "MrBreakout": "okay i think most people know i'am a regular here in this project and planning to keep it as is.\nI would like to nominate myself again for the council position and drive the governance.\n\nthanks in advance for your votes!\n\nmrbreakout.eth",
    "juozakac": "Hello GM , I am IPMY5 ipmy5.eth . I have been in sportsbetting for more then a decade. Using overtimemarkets from beginning. I really like the decentralised approach of overtimemarkets. I think I would be good addition to council for sportsbetting questions. How to navigate with new markets where to be carefull. Which betting options to offer, and which-  not. more then 10 years in betting and making living from it might be helpful. Also I am not new in crypto been here from 2017. So all overtime market lovers, especially LP providers Vote for me I will secure your LP's from sharp action 🙂",
    "alex81sg": "Dear Community,\n\nI would like to renew my nomination for the Council for the second time.\n\nI’m currently a Council Member, a Thales user, an Overtime bettor, a staker, an LP provider and an active community member, therefore I deeply understand all aspects of the platform.\n\nDuring the current term as a Council member, I believe I successfully represented the community by voting in favor of the following TIPs:\n- TIP-195: Optional auto compounding\n- TIP-196: Participate in Big Bang competition\n- TIP-197: LP incentives tapering, moving POL position\n- TIP-199: PYTH airdrop allocation\n\nI voted against “TIP-196: Participate in Blast Big Bang competition”.\n\nAs a Council member, I pledge to continue to be a balanced advocate for Thales holders/stakers, LPs, and platform users. My $THALES stipend will continue to be promptly staked, as it has been during the past months.\nIf I am elected, my focus for the next term will be on supporting the following:\n- Increasing user base through improved features/functionalities\n- Augmenting the utility of the THALES token\n- Periodic re-assessment of tokenomics and incentives, based on market circumstances\n- Thoughtful use of future ARB/OP grants and PYTH airdrop allocation, with focus on rewards for competitions, marketing initiatives and incentives campaigns.\n\nI believe that increasing the platform user base and the Thales’ footprint in the digital option and sports betting markets are the key to long-term success.\n\nI will continue to always respect everyone’s opinion, voice mine, and foster an environment where productive discussions can eventually translate into tangible value creation for THALES and its stakeholders.\n\nThank you!\n\nENS: redcondor81.eth",
    "cyberduck | Spongly": "gm\n\nDucky here from https://spongly.eth.limo/ here to represent.\n\nNo change from my prior epoch's goals in being a council member that helps navigate Thales/Overtime on a continued growth path and to reflect that growth in earned value for all parties involved - stakers, LPs and integrators alike.\n\nWe have great contributor team that continues to iterate a gem of a product that is a pleasure to integrate.\n\nEns: wisequacker.eth\nX: https://x.com/cyberducketh",
    "holmberg": "Vote cat to zebra council!\n\nI would describe myself as a very active Thales user. I haven't been council member before, but I have tried to help in the background and learn more about different products now over 1 year.  🥳\n\nI have been professional bettor on-off over last 10 years and I can from there bring something to Overtime, especially related to UX and promotions. I have previously take part to changing the parlay competition and parlay UI. I have also suggested promotion page and tens of other QOL changes to Overtime. In my opinion, the UFC campaign was a good example of a better gamification, where rewards in one event brought good volume in very short time window, but I see there is other even better options to try.\n\nIn short my focus will be in council:\nPromotions which benefit Thales long term and are economically more sustainable\nKeep Thales tokenomics healthy\nInteract with other users and help moving their suggestion forward\n\nThanks for your votes!\n\nENS: holmberg.eth",
    "Svenska": "Hey friends,\n\nThis time I'll try to keep it short, I think you know me well enough by now to know what I stand for and try to achieve as a council member.\n\nThis last epoch has not been the most active in terms of proposed and voted TIPs, largely due to the focus we all want to give to Overtime v2.\n\nWe did, however, try a few things (competition on Blast testnet with Speed Markets), continued to improve THALES liquidity efficiency by considerably reducing emissions, and voted on a distribution plan for PYTH's airdrop, which I hope will prove its effectiveness.\n\nIf you put your trust in me once again, I can guarantee that I will continue to defend the best interests of all stakeholders, while proposing and testing new initiatives to help drive Thales forward.\n\nThank you for your time.\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "milkywave": "gm and henlo.\n\nAs previously mentioned, the last epoch does not seem to have been the most active one from a governance perspective. However, I believe fundamental decisions were made and there have been great discussions like:  no, we don't have to follow every hype, and yes, there are votes where the council does not accept a TIP with 7 votes. This is what makes governance great!\n\nI would also like to be part of the next councils! The closer we get to Overtime v2 and the spin-off of Speed Markets as a separate product, the more good governance discussions will arise, demanding significant decisions. I would be happy to be part of this!\n\nI can promise to continue being open to compromises in decision-making, actively participating, while also standing my ground on my viewpoints, just as I have done before. 🙏 \n\nThanks for a vote for Milkywave 🥛 🌊 \n\nENS: cocomilk.eth",
    "Cvija | Thales": "Hey governors,\n\nMost active users probably know me also as a very active user here in Discord and on-chain. Just wanted to drop this pitch if Thales needs new blood to the council.\n\nI'm a full-time sports bettor since 2015 (bio for track record), well connected in the space advising e.g. web2 broker Algotech, and in the last five years been building different projects in web3 as well, such as a venture capital, a platform for decentralized investing and a marketing management tool.\n\nMy expertise would mostly be fit with optimising the experience on Overtime Markets for both the users and LPs but also making the campaigns more fair and effective. Also as the V2 approaches for OT, would gladly help Thales in selecting and modifying the sport, league & market selection, and the algorithms behind them that benefit all parties.\n\nVote me if you wanna experience and real protocol user to council with a deep background in the industry.\n\nENS: lowstakes.eth",
    "Coman": "Hi there governors, good to see you again! 🍺 \n\nAfter a couple of months, I decided to run again for the council seat.\n\nIf you are present in the Thales discord, you probably know me, but I will introduce myself briefly once again:\n- I have been a core contributor at Thales for 2.5 years now, handling mostly the quality side of the product, some growth stuff, and providing support for new and existing users.\n- I served in the council before on multiple occasions, both in the Thales and the Oracle council, so I am very familiar with the governance mechanism.\n\nWhat I bring to the table is a very broad understanding of the protocol itself, both from the user and the contributor side, since I am involved with marketing, growth, dev, test, and design, so I can most likely provide a unique perspective on things.\n\nMy goal for this epoch would be to follow the upcoming narratives and react quickly when needed, spread the word about Thales both on social networks and governance forums, and prepare the space for the v2 release. :V_: :2_:\n\nHope to serve with some of you gentlemen once again, cheers!\n\nENS: cvija.eth"
}
