{
    "BigPenny": "Hello fellow Thales Chads!\n\nMy positions have not changed from last time. I still represent the $THALES Stakers as the owners of the DAO and the Thales Protocol. It is my everlasting goal to ensure that staking $THALES is a profitable endeavor. This means direct revenue payouts to Stakers but also ensuring that the protocol focuses on profitable operations, like consolidating our efforts on the most suitable chains, only offering successful products and continue to develop markets that show solid promise for success. I also want to shift some of our focus on how we can make Thales and Overtime more resilient, to ensure continued operation, no matter the incident.\n\nThales is way past being a “start up” but there are still tons of opportunities to grow. With our competition under increasing pressure there will be lots of voids to fill and niches to explore. I’m looking forward to represent the Thales community for the upcoming epoch where we will tackle those challenges together!\n\nbigpenny.eth",
    "holmberg": "Vote cat to zebra council again!\n\nI would describe myself as a very active Thales community member and protocol user. I have been in council last epoch and I would love to continue my work there.\n\nI have been professional bettor on-off over last 10 years and I can from there bring something to Overtime, especially related to UX and to different promotions. My focus in council has been and will be in future to make promotions fair and good as possible to real users, make Overtime feel like standard booker which many user have already used to and try stop any toxic flow from protocol.\n\nMy Thales CV:\n - Parlay competition overhaul\n - Thales boost V2\n - Referral reward TIP\n - Promotion page\n - Tons of QOL changes\n - Found several bugs\n\nThanks for your votes!\n\n0xd4411afb9abdc6b3e8b04dd94cba9c587ef5f90c",
    "MrBreakout": "Allright Allright Allriiiight !\n\nDear community, I'am here again to ask for your help to get into council,\n\nI'am quite active member of the community, I have provided feedback on most of the TIPS, did not skip a vote, written couple of TIPs last epoch and  following stats closely on #⁠🏠︱liquidity-providing channel every week, i had been in council more than 5 epochs and got enough knowledge about inner works of the protocol.\n\nWith new sports market season on the horizon, we will see lots of action on overtime v2 and in this critical and exciting times i would like to be in a position to represent you in the council.\n\nit will be glorious epoch , please vote for me !\n\nThank you\n\nmrbreakout.eth",
    "luigy 𝗹𝗲𝗺𝗼𝗻": "I am applying for the council to see what it's like.\nBeen using the platform since its early days and thinks there's still lots of room to grow and improve\n\nluigy.eth",
    "Bulls-vs-Bears🐻": "Greetings, Thales Fam,\n\nI’m Bulls-Bears, your DeFi-loving, crypto-obsessed friend, and I’m excited to announce my candidacy for the Thales Council. While I might be new to the Thales community, I’m no stranger to the crypto space. I’m currently on the Kwenta board, and I’m ready to bring that experience over to help Thales soar to new heights.\n\nCrypto Experience:\n\nI’ve been navigating the wild world of crypto for years, through both bull and bear markets. Along the way, I’ve picked up a solid understanding of what makes a project successful and how to ride out the tough times.\n\nSkills and Experience:\n\nMarketing: I’ve led marketing campaigns that not only increased visibility but also built strong, active communities. I know how to make a project stand out and get people excited.\n\nShitposting: Let’s be honest, in the world of crypto, a well-timed shitpost can be as valuable as a well-timed trade. I’ve got the skills to keep the community engaged and entertained while pushing the conversation forward.\n\nVision for Thales:\n\nOne of my key goals, if elected, is to get Thales listed on more centralized exchanges (CEXs). But that’s just the beginning. I’ve got a whole list of ideas and goals that I’m eager to tackle, all aimed at making Thales more powerful, more accessible, and a leading force in the crypto space.\n\nIf you want someone who’s passionate, experienced, and ready to get to work, I’m your person. Let’s take Thales to the next level together!\n\nThanks for considering my nomination—I won’t let you down!\n\nEthereum Address: 0x55dda08152cb1dbddaa789efba3e0632a5aa2c9e",
    "cyberduck | spongly.io": "Sup fam.\n\nBrief intro. Long time Thales councillor, $Thales DCAooor, founder of https://spongly.eth.limo/, recently integrated Overtime v2 and working on relaunching the copy betting feature. We're also in pre-seed phase, soon raising hoping to expand our product offering and focus on actual user acquisition. Representing Spongly, we'd love to have a continued voice in Thales governance.\n\nCheers,\n\nwisequacker.eth",
    "cryptolawyer": "Hey governance watchers - throwing my hat in the ring here and offering something a little bit different for a skillset.\n\nLong-time user of Overtime and have sent more than a few people to the platform since launch. Was mining dogecoin back in 2014 and got really into crypto in 2017 when I discovered makerdao. from there it was the rocketpool ICO, curve farming, etc. Have been all in on the ethos since, and even pivoted my legal career towards it.\n\nHaving spent time at two massive biglaw firms focused on VC/startups, made the jump to lead legal in-house at a music nft company. raised in the 50m+ range before the team decided to pivot and i decided my skillset was best used elsewhere (although they are still a client).\n\nfounded my firm about a year ago now and have scaled up pretty quickly in volume, bringing on a partner, an associate and three contractors. servicing almost exclusively crypto startups, protocols, daos and investors across the spectrum of verticals in crypto. have built a great skillset from that work as well as a great network.\n\nwould love to give back to this community and help move the project forward via the governance role. my blend of crypto-native experience and regulatory/corporate legal skillset could provide some new color to certain areas and happy to work through anything the team is looking to achieve more mid-long-term on the structuring or product side. this type of work is the favorite part of my job.\n\nhere as a resource regardless of the outcome on the vote. we're all in this together, so let's make it fun.\n\n(on mobile currently so giving my smart wallet address below instead of ens)\n0x7474765fc6629E96696F1e1b0460419b4478D8dc",
    "Coman": "Hey everybody,\n\nMost active users probably know me also as a very active user here in Discord and on-chain. Just wanted to drop this pitch if Thales needs new blood to the council.\n\nI'm very well connected around web3 and sports betting space, and hoping to contribute more into the governance side as well to foster the future of OT/Thales.\n\nVote me if you wanna experience and real protocol user to council.\n\n0x26585f6582bcDcAC350F060AecAda9E92889d570",
    "Cvija | Thales": "Hi there governors, I decided to submit my pitch once again!\n\nHere is a brief introduction if you do not know me:\n\nMy name is Cvija, and I have been a core contributor at Thales for almost 3 years now, handling mostly the quality side of the product, some growth stuff, and providing support for new and existing users. I also have been a counciloor a couple of times already!\n\nI am a heavy defi user, some would say full-time, and try too keep up will all of the new things happening.\nI bring a broad understanding of the protocol from both user and contributor perspectives, thanks to my involvement in marketing, growth, development, testing, and design.\n\nWith the project being more battle tested than ever, and offering a better range of sports on Overtime, almost on par with tradition books, my primary goal for this epoch would be make Overtime THE place for your onchain sports.\n\nThanks everyone and see you around!\n\nENS: cvija.eth",
    "padzank | Thales": "Hello Thales Titans,\n\nWe are at the turning point. Overtime V2 is proving to be the killer app that people love to use, with all the bells and whistles on par with web2 competition. Numbers are going up together with supported features and offerings. This governance epoch will have a task of finding a balance between the rapid growth of Overtime and what is the best way forward for the underlying Thales Protocol.\n\nI am nominating myself for a seat at the Thales Council for this epoch. I wish to support the governance structure more closely in the time period to come and to again act as a clarity bridge between core contributors and the community governance structure.\n\npadzank.eth\n0x11219d61e95fC5930762b16868dDB2C9c6fc83fA"
}
