{
    "holmberg": "Throwing my name in for Council again.\n\nBeen around Overtime since early 2023. Lately I've been more of a lurker, but still following what’s happening and definitely still care about Overtime and also still using protocol.\n\nWhat do I bring to the table?\nI’ve suggested a bunch of features in the past that ended up getting implemented, and I’ll keep throwing out ideas to make Overtime better. I try to think about things from a regular user’s and professional bettor's point of view. How to keep the protocol user-friendly and the betting experience feels familiar, like what people are used to from other sportsbooks. Trying to help build something cool and long-lasting.\n\nI'm also long time exchange/orderbook user. I know what users expect when using those systems, so if we’re heading in that direction alongside the sportsbook, I can help make sure it actually feels right to use.\n\n0x6592602fb118a553ea4a10C7f8bec28c4903B296",
    "mluke | Overtime": "Hi everyone, mluke here, a core contributor since September 2023. This is my second time running for council.\n\nIn the past few months, I have been focused on getting as many people to try Overtime as possible. This has mostly taken place in betting communities on X, and lately, Farcaster, where I believe there is so much more potential for user growth.\n\nThis experience has allowed me to see the product with different eyes: those not used to switching between networks, Overtime/EOA accounts, or even using wallet addresses & making crypto deposits. I’ve seen how new users (both normies and those versed in crypto) think and where they stumble during onboarding.\n\nOvertime has made big steps in improving onboarding for a wider audience, but there’s still ways to go. I believe my everyday experience from the trenches positions me uniquely to help the protocol improve in reaching new people and making them stay.\n\n0x16b8A6a31ec0419a032dee56Ea709319dA1BA9b0",
    "Brad | Giraft.io": "Hello All,\n\nI would like to be considered again for another term on the council. I will always provide honest feedback and try to push the web3 sports betting market forward.\n\nAt Giraft we have a longterm vision and think this specific sector will explode in the coming years. We also have been revamping our backend and product and will have a major announcement in January with a lot of user incentives up for grabs.\n\n$OVER is one of few long term conviction plays, the product is continuously improving, the users are here and growing, everything is moving in the right direction and think we have a competent group of lads to take this to the next level.\n\nThanks,\nBrad\ngiraft.eth",
    "keenanallen": "Hello all, fairly new here , but I would like to be considered for a term on the council. I’ve always been obsessed with decentralized gambling protocols and I genuinely believe they will account for the vast majority of the gambling market in the future. I think Overtime is on the verge of a major growth spurt, and I’d love to be a part of it. Figured the best way to do this is just outline some issues I see and what I’d recommend.\n\nAfter spending time with the dApp and reviewing the improvement proposals, I see liquidity per market as one of the biggest constraints. I agree with Chaz that “we have to start asking how we can generally draw non-native crypto people to Overtime and make it feel like they aren’t using a crypto dApp.” The UI can certainly be improved, but the real key to attracting and retaining non-native crypto bettors is ensuring they can bet what they want, when they want, just like they can on an offshore book or PPH. Limiting their ability to place live bets, props, or higher-limit wagers is exactly what would drive them away.\n\nI would propose developing a new liquidity protocol that enables all bets to have a max payout of around $20k. For wagers above a certain threshold, we can explore using automated arbitrage through a decentralized platform, as mentioned previously.\nOne of Overtime’s biggest selling points is the ability for bettors to contribute to LP tokens and effectively become part of the house.  I recommend removing lock-ups for adding LP, while implementing logic to adjust for collateral in use during deposit or withdrawal.\n\nWhat Overtime does exceptionally well is its functional tokenomics. Using protocol revenue to increase the value of what is essentially the “shareholder” position is something most companies fail to execute, and it drives me insane. Overtime actually gets this part right.\n\nI’m also a full-stack engineer and run a lead-generation/advertising agency, if either of those skill sets could be useful.\n\nThanks, 0xd1a7409df742b91dc9390759977aed0c3a30033e",
    "MrBreakout": "Hello everybody,\n\ni decided to run again after a long break\n\neven if i believe council is not necessary like old days,\ni would like to have a seat to safe guard the status quo and keep an eye on important decisions to be made\n\nThanks in advance for the votes !\n\nmrbreakout.eth",
    "Chaz | Overtime": "Yo yo,\n\nI’m here again nominating myself for another term on the council.\n\nAlbeit a slower decision making term this last go around - I never stopped working and pushing Overtime forward. During this term I became a core contributor to help expedite the process of user acquisition and growth. From this we’ve partnered with multiple media personalities, launched engagement campaigns, and begun to bridge the gap of web2 sportsbook users to the best web3 cryptobook around.\n\nJobs not done though. My continued effort is aligned with the goal of making $Over an even more valuable asset and Overtime being recognized as the most fair and transparent book by even more bettors and degens.\n\nI hope your votes will find your way towards me once again. Thank you!\n\nChaz\n\n0x7acc9b72b5f58433ff1612e367eeb9ed4043f7a9",
    "cyberduck": "Hey, I'm back!\n\nI'm an OG, former councilor, and long-term $OVER holder. Took a break from governance. Previously tried integration (Spongly) that didn't work out. Overtime has however matured. The core team is competent and handles key parameters well. At this point, the council isn't strictly necessary. Any tokenomics changes (none seem upcoming soon) could go directly to token holder votes in my opinion, so let's see if governance has a room for further change. If elected, my full stipend goes straight to gambling on parlays, no keeping it or selling unless gambled first. Vote if that aligns.\n\ncyberduck\n0xfF684104992bd26B6326bcA4620D733526c0Ddb1",
    "luigy lemon": "You all know me… been in council before and it has been quite inactive lately.\n\nIn respect to governance, I’d like to vote to get better data providers.  (I know it’s a struggle… but needs some investment clearly)\nAlso believe that there’s room to make more money with some casino 🎰 type game offer with OVER tokens that the speed trading does not cover well enough.\n\nI want to get to 1M $Over and every bit counts. Please vote for Lemon.eth",
    "Bixby Snyde aka TheWiseBull": "Overtime Council Nomination: Bixby Snyder\n(aka TheWiseBull on Discord)\n\nENS: BixbySnyder.eth\nX: @BixbySnyder_eth | Farcaster: BixbySnyder.eth\n\n⸻\nIntroduction:\n\nI’m Bixby Snyder, an Overtime supporter since the protocol’s inception during the Thales era. From early experimentation through today’s Overtime V2, I’ve stayed closely involved because I believe Overtime can become the default on-chain sportsbook.\n\nI’m running for Council to contribute at the governance level and help steward the protocol through its next phase of growth.\n\n⸻\nImpact on Overtime’s Growth:\nMy involvement hasn’t just been as a user; it’s been about driving adoption.\n\nI began referring users on Oct 3, 2022, spanning Overtime V1 → V2. Per on-chain affiliate data (Dune: https://dune.com/leifu/thales-affiliate-overview), my total referral activity shows:\n- 88 unique referred users\n- 6,980 affiliate-generated trades\n- $1.15M+ in referred betting volume\n\nThis growth was organic, driven via X/Farcaster, Discord engagement, and content creation, not paid campaigns or incentive farming.\n\nOT V2 personal usage (since launch):\n- 144 bets | $1,904 volume | ~$13 avg bet\n- Active since June 19, 2024\n\n⸻\nWhat I Bring:\n\nI’m a full-time crypto market analyst and DeFi participant, active across protocol governance and on-chain strategy development. My work focuses on incentives, liquidity, user behavior, and sustainable growth.\n\nBefore crypto, I served as CEO of a large organization, leading complex operations across 1,000+ employees and 8,000+ stakeholders, experience that informs my structured, accountability-driven governance approach.\n\nMy governance philosophy: no theater, no unnecessary friction, enhance execution, don’t obstruct it.\n\n⸻\nGovernance Focus & Market Vision:\n\nI’m a lifelong sports fan (NCAA/NFL, MLB, NBA, UFC, boxing).\n\nI see strong opportunities in:\n- Specialty markets (WWE as one example)\n- Deeper props & live betting\n- Speed Markets growth\n\nSpeed Markets feel underutilized. In a perps-crazed era, they’re well-positioned to capture short-duration, high-conviction traders if liquidity, UX, and discovery continue to improve.\n\n⸻\nClosing:\n\nI’ve supported Overtime since its earliest days, not passively, but by bringing users, volume, and attention to the protocol. I believe in the team, the product, and the opportunity ahead.\n\nI’d be honored to help guide Overtime’s next phase via Council.\n\n— Bixby Snyder"
}
