{
    "MrBreakout": "Hello thales community!\n\nI'am here to nominate myself for next epoch, I'am familiar with thales since inception and served as council numerous times in past. I believe we could shake the protocol a bit with upcoming bull season so i would support a 1:1 convertion to a brand new Overtime token to strengthen our name & marketing.\nWe are having ATH volume on overtime, its getting smoother and complaints are mostly about lost bets :pepelaugh: , protocol PnL is over a million usd and it will get only better from here\n\nvote for mrbreakout.eth",
    "holmberg": "Vote cat to zebra council again!\n\nI would describe myself as a very active Thales community member and protocol user. I have been in council last epoch and I would love to continue my work there.\n\nI have been professional bettor on-off over last 10 years and I can from there bring something to Overtime, especially related to UX and to different promotions. My focus in council has been and will be in future to make promotions fair and good as possible to real users, make Overtime feel like standard booker which many user have already used to and try stop any toxic flow from protocol.\n\nMy Thales CV\n- Parlay competition overhaul\n- Thales boost V2\n- Promotion page\n- Tons of QOL changes\n- Double-up / Triple-up\n\nThanks for your votes!\n\nholmberg.eth",
    "mluke | Thales": "Hi everyone, I am mluke, a CC at Thales and this is my first pitch ever.\n\nI’ve been a core contributor since September 2023. I've been in traditional marketing, SEO and website technical optimization, and paid advertising since 2017. My CC role includes responsibilities in these areas, as well as content creation and community management.\n\nLike everyone, I see the most potential for Thales/Overtime in user acquisition. I'd love for us to get better at grabbing people's attention outside of crypto. I see two paths to achieving this.\n\nGuerilla marketing. I use this term because traditional advertising channels such as paid campaigns on Google or X are highly restricted in our case and generally ineffective in crypto.\n\nI want to turn our attention to sponsoring betting newsletters, cappers, communities, streaming sites, etc. Also, increasing brand awareness through organic posts on Reddit, X, Discord servers, supported by the Olympians - every web2 bookie is doing something similar, and so can we (better than them).\n\nMass adoption. Anyone should be able to use Overtime without even knowing about Ethereum wallets. Once the dev team wraps up full account abstraction similar to Speed Markets, our focus should be super clear, detailed tutorials and making onboarding as effortless as possible, especially for normies.\n\nIf you vote for me, I'll do my best to steer our conversations toward achieving these.\n\nThank you!\n\nmluke.eth",
    "milkywave (🥛🌊)": "Henlo milky is back!\n\nNominating myself after a quick break. I would be happy to serve in the next epoch for you guys!\n\nFull power to push a rebranding of Thales into a Overtime token to get some new wind into the sails! There was never a better moment  than now, OT Volume on ATH, AA & we're in a full bullmarket and tons of amazing sports coming up next year!\n\nAlso happy to help on new marketing approaches and hopefully even reach our friends on Base!\n\nAlways here to represent the community and try to find a compromis between you guys and what's best for the protocol (and yes we saw in some other DAO's this decisions are not always easy).\n\nThank you\n\nMilk is ready to goooovern again.\n\ncocomilk.eth",
    "Svenska": "Hey friends,\n\nI've had the honor of representing the members of Thales for several epochs in the past, and I'd like to present my candidacy once again\n\nThis new epoch is shaping up to be an exciting one as Overtime now has a solid base from which to compete with the major web2 competitors in terms of offerings, while upholding the decentralization we value so deeply.\n\nNow it's time to step up a gear and make Overtime the reference application everyone knows when it comes to decentralized sports betting\n\nThis will certainly involve a rebranding of Thales, as many have already mentioned, which will have to be accompanied by a meticulously prepared communications campaign, « You only get one shot, don't miss your chance to blow »\n\nIf you put your trust in me once again, I can guarantee that I will once again defend the best interests of all stakeholders, putting all my energy to discuss every proposal, trying out new things, and finally voting on the TIPs that will be submitted to us.\n\nThank you for your time\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "luigy 𝗹𝗲𝗺𝗼𝗻": "Lemons likes to vote!\n\nHello again my friends, since when i joined the Council i lost basically every bet and token pumped so I'm directly correlated with the growth of this protocol by being cursed by the greek gods.\n\nIf you want protocol to keep growing you have a mandate from Zeus himself to re-elect me.\n\nI have worked in defi for the past couple of years, and can contribute a lot in that area. Know all about most protocols, yield bearing assets and their risks across the space and think Thales is missing out on not exploring this tier of composability a bit further. If there's an intent to get more yield, points farming, cross-protocol partnerships, i'm happy to help.\n\nluigy.eth",
    "padzank | Thales": "Greetings to all Thales community members and Overtime enjoyoooooors!\n\nCC-ing at Thales/Overtime, growing things. Things are scaling up exponentially, we are growing fast meaning we need to be on top of things now more than ever. It is an understatement that 2025 will be our biggest year yet, considering the performance of Overtime and whats in the pipeline. UX will scale exponentially in Q1, Overtime will become the main brand of the protocol and a household name of the space. The bullrun is kicking off and the craziness begins. Hope the next council has what it takes to follow it through. Roll up the sleeves now more than ever bois. Put your serious face on. Big things coming.\n\nPitching my name again for Thales Council. Let's continue the good work.\n\npadzank.eth\n0x11219d61e95fC5930762b16868dDB2C9c6fc83fA",
    "BiGs": "Hello fellow Thalians.\n\nI am nominating myself for the next council epoch. I’m 38 years old from Australia. I have been in the Synthetix community from Havven launch in 2018 and rolled straight into Thales launch. I am a loyal holder of both SNX and Thales tokens from the start until now and have always been involved in the community along the way. I have run for Thales council a couple times previously but have yet to sit.\n\nThales has made leaps and bounds over the years and is one of the rare protocols that has a true revenue generating decentralised business model in full swing. I’ve watched Overtime volume grow three fold in the last year which is amazing. The sports betting vision in the original roadmap always had me amped from the start and it’s good to see it shine now. I have never been much of a bettooooor but growing up in Australia through the 90s and 00s, it's ingrained in my soul. All familiar ground.\n\nI would be all for a fair Overtime token transition and launch. It seems the best awareness event you can do in this space with solid timing. I know there are oracle constraints however I would love to explore possibilities of going further down the prediction market road.\n\nI do not work in IT and don’t have the developer skills that many others in this space have, however I have been self employed my whole life and have a very pragmatic approach to decision making within a business. I feel I can add meaningful insight and discussions on protocol decisions ahead.\n\nIf elected I promise to not be a passive council member. I will actively participate in discussion, explore the corners of the protocol that I have less experiences with as a user, and proactively discuss and draft TIPs on any new idea that could help this community grow, adapt and earn.\n\nIt would be an honor to further serve the community.\n\nbigs.eth",
    "Coman": "Hello,\n\nAfter careful deliberation I am hereby re-applying to the Thales Council. Truth be told, I was long in favor of sitting out the next epoch due to many things planned being not my strengths, and as I'd on one side rather be looking on more betting-focused role on Thales/Overtime (which probably isn't exclusive to being a councilor). I feel though, that some of the things on the pipeline here will completely define the future of Thales/Overtime, and as I'm personally so deeply invested in the project, I'd like to have my voice heard as well.\n\nMost of you know me as a long-time Overtime user with a real passion for decentralized sports betting. It’s something I care about deeply, especially since I’ve been limited—or outright excluded—by most traditional bookmakers. I’ve been an active and vocal member of this community for nearly two years, and I’m proud of the progress we’ve made together.\n\nAs a current council member, I feel we’ve made huge strides on the betting side, from launching new markets to adding more variety to what’s available — and there’s more on the way. While betting might not be the main focus of the next epoch, there are big tasks ahead, like rolling out the potential $OVER token and rebranding overall. Even though I’m not an expert in tokenomics, I’m ready to make sure we get this right. And beyond just getting it done, I want to ensure it’s backed by strong marketing campaign — because what’s the point of a rebrand if no one knows about it, especially in an extremely competitive bull market?\n\nI’ve been a KOL before, and I have a couple of connections with marketing agencies that I think could really help us make an impact. Whether it’s through those connections or just ensuring we stay focused on building awareness, I’m ready to help.\n\nIn short, I care deeply about this project and its future. I’d love the chance to keep contributing to Thales/Overtime as a council member and to play a part in shaping what’s next.\n\nCheers!\n\nnutduck.eth"
}
