{
    "common": {
        "wallet": {
            "connect-your-wallet": "Connect wallet"
        }
    },
    "home": {
        "thales": "Thales",
        "protocol": "Protocol",
        "protocol-description-1": "A permissionless ecosystem where every derivative market is a unique smart contract",
        "protocol-description-2": "Powered by pioneering AMM architecture and permissionless liquidity pools, any oracle provided pre-event probability data and post-event results data can be made into a tokenized derivative market by using the Thales Protocol architecture.",
        "total-protocol-volume": "Total protocol volume",
        "total-value-locked": "Total value locked",
        "total-unique-users": "Total unique users",
        "see-all-stats-button": "See All Stats",
        "ecosystem-apps": {
            "title": "Ecosystem apps",
            "thales-markets": "Digital Options marketplace built using Thales architecture. Thales Markets allows anyone to buy positions on crypto strike prices on specific dates. Any user can receive a fixed payout if a specific price condition is met at a specific expiry date. Choice of conditions vary from UP, DOWN, IN or OUT compared to chosen strike price(s).",
            "overtime": "Onchain Sports Markets Automated Market Maker (AMM) interface with integrated Parlay AMM architecture. Built on top of Thales Protocol technology, Overtime offers seamless user experience for all sports enthusiasts while bolstering transparent full collateralization at all times and permissionless security of the Ethereum network.",
            "spongly": "Spongly is Sports Markets dapp built on top of Thales' SportsAMM and ParlayAMM with a social twist. Take an opportunity to copy trade best sports traders, view individual wallets success rates and have a more detailed overview of all global parlay tickets. Use trading wisdom of the best to your own advantage!",
            "telegram": "By connecting Thales smart contracts to Telegram Bot trading interfaces, several new projects were born. These projects utilize simple trading experience within the easily accessible Telegram app to grow their userbase while leveraging the Thales collateral and onchain market making architecture to provide the backend.",
            "tale-of-thales": "Tale of Thales is a Metaverse minigame that takes you through retro pixel experience of an ancient Greek town of Miletus while teaching you how Thales Markets trading works. You can play the single-player or you can join the multiplayer metaverse, explore the infinity hotel, chat with other players or mint NFTs."
        },
        "investors": {
            "title": "Investors"
        },
        "integrations": {
            "title-link": "Tailored for Developers",
            "title": "Seamless Integration and Boundless Possibilities",
            "description": "To the developers poised to shape the future of simple derivatives trading: Thales is your canvas. Our protocol is meticulously designed to ensure that you have a frictionless experience in developing your applications with Thales infrastructure guaranteeing collateral liquidity, market making and security in the background. With comprehensive resources, including in-depth developer documentation, responsive tech support and a vibrant Discord community, Thales empowers you to realize your vision with precision and ease.",
            "thales-sports-markets-api-title": "Thales Sport Markets API",
            "thales-sports-markets-api-description": "Leverage the decentralization of the Ethereum network and it’s Smart Contracts for full collateralization and decentralization of a wide offering of global Sports Games Markets. By using Thales’ Sports API for SportsAMM and ParlayAMM integration, any developer can permissionlessly have access to a worlds most transparent and fair Sports Markets data with included cutting edge liquidity and trading infrastructure.",
            "thales-digital-options-api-title": "Thales Digital Options API",
            "thales-digital-options-api-description": "Thales Digital Options contracts provide integrators access to Automated Market Maker, on-demand liquidity and collateralization architecture for onchain Digital Options. With various supported assets ranging from crypto assets to commodities, anyone can integrate with ThalesAMM and RangedAMM contracts and provide it’s users simple-to-use and permissionless derivatives trading platform. Users can instantly place a position on whether the selected Asset Pricewill be UP or DOWN from selected Strike Price on selected Strike Date. Similarly, users can place IN or OUT positions on Price Ranges of the same Assets.",
            "thales-speed-markets-api-title": "Thales Speed Markets API",
            "thales-speed-markets-api-description": "Thales Speed Markets contracts is the newest Thales Protocol product that leverages Pyth Benchmark oracles to facilitate a front-running-free backend for fast intra-day digital options. Users of Thales Speed Markets contracts are able to speculate on the direction of a Crypto Asset price with custom market expiry that can go as short as 15 minutes. With a fixed potential return of +100% (minus the fees) for any type of open market and thus not needing a pricing algorithm, Thales SpeedMarketsAMM contract is super-lightweight and easy to integrate.",
            "integrate-with-thales-button": "Integrate with Thales"
        },
        "buying-selling": {
            "title": "Every Possible Outcome As An Erc20",
            "description-1": "Thales Protocol architecture tokenizes all unique positions as ERC20 tokens. Every market has a set of unique ERC20 token types that cover all potential exclusive outcomes of that market. These tokenized positions are minted by locking USD collateral in the designated Market Smart Contract. Each locked 1 USD mints 1 of each type of ERC20 tokenized positions. Only one type of these ERC20 positions can win on market expiry and only that type can claim the locked USD, while the losing ERC20 positions expire worthless. With this permissionless and automated architecture, Thales Protocol guarantees transparent and non-custodial full collateralization for all positions at all times.",
            "description-2": "With liquidity and collateralization solved, the next necessary step is pricing the minted positional ERC20 tokens and allowing for a good trading experience to the public. This is where the unique design of Thales Automated Market Maker comes into play. The Thales AMM contract is whitelisted to mint the ERC20 positions by locking the Liquidity Pool collateral funds in the designated market contracts. After minting, the AMM offers the ERC20 positional tokens on-demand to traders based on Algorithmic Probability Pricing that determines the fixed potential payout on market expiry.",
            "buying": {
                "title": "Buying a position example",
                "step-1": "ThalesAMM algorithmic probability pricing quotes BTC UP Options at $0.5 per Option",
                "step-2": "User wants to buy 1000 BTC UP tokens from the ThalesAMM for $500",
                "step-3": "ThalesAMM takes $1000 from the LP pool",
                "step-4": "ThalesAMM deposits $1000 to the Market Contract and mints 1000 BTC UP and 1000 BTC DOWN tokens from the Market Contract",
                "step-5": "ThalesAMM receives $500 from the User and sends 1000 BTC UP tokens to the User"
            },
            "selling": {
                "title": "Exercising a winning position example",
                "step-1": "Bitcoin price was above the Strike Price on the Maturity Date which means that User’s 1000 BTC UP positions are resolved as winning and every 1 BTC UP token is redeemable for $1 while BTC DOWN tokens are deemed worthless",
                "step-2": "User sends his 1000 BTC UP tokens to the Market Contract and claims the $1000 from the contract"
            }
        },
        "governance": {
            "title-link": "Community-Centric Governance",
            "title": "Steering the Future, Together",
            "description": "At Thales, we believe in the collective wisdom of our community. Our governance structure, underpinned by ThalesDAO and the Thales Council, is a testament to our commitment to decentralized decision-making. Every strategic move, every initiative, is guided by the voice of our community. Through a transparent and robust DAO voting mechanism, we ensure that Thales remains of the community, by the community, and for the community.",
            "explore-thales-dao-button": "Explore Thales DAO"
        },
        "timeline": {
            "title": "Timeline"
        },
        "infrastructure": {
            "title": "Infrastructure Partners"
        }
    },
    "header": {
        "links": {
            "dashboard": "Dashboard",
            "staking": "Staking",
            "governance": "Governance",
            "docs": "Docs",
            "whitepaper": "Whitepaper"
        }
    },
    "footer": {
        "discord": "Discord",
        "github": "Github",
        "twitter": "X",
        "docs": "Docs",
        "medium": "Medium"
    },
    "dashboard": {
        "ecosystem": "Ecosystem",
        "networks": "Networks",
        "governance": {
            "title": "Governance",
            "start-date": "Start date",
            "end-date": "End date"
        },
        "integrators": {
            "title": "Integrators volume",
            "total-volume": "Total volume"
        },
        "protocol-volume": {
            "total-protocol-volume": "Total protocol volume",
            "safebox-fees": "Safebox fees",
            "thales-amm": "Thales AMM",
            "overtime-amm": "Overtime AMM",
            "parlay-amm": "Parlay AMM",
            "average-unique-users": "AVG unique users",
            "average-monthly-users": "AVG monthly users"
        },
        "staking": {
            "title": "Staking",
            "total-stakers": "Total Stakers",
            "total-thales-staked": "Total Thales staked",
            "of-circulating-supply": "Of circulating supply",
            "of-total-supply": "Of total supply",
            "staked-on-arbitrum": "Staked on Arbitrum",
            "staked-on-optimism": "Staked on Optimism",
            "staked-on-base": "Staked on Base"
        },
        "token-addresses": {
            "title": "Token addresses",
            "bridge": "Bridge",
            "optimism": "Optimism",
            "arbitrum": "Arbitrum",
            "base": "Base",
            "mainnet": "Mainnet"
        },
        "token-burn": {
            "title": "Thales token burn",
            "total-thales-burned": "Total Thales burned",
            "of-circulating-supply": "Of circulating supply",
            "of-total-supply": "Of total supply"
        },
        "token-info": {
            "title": "Thales token info",
            "total-supply": "Total supply",
            "circulating-supply": "Circulating supply",
            "burned-supply": "Burned supply"
        },
        "tvl": {
            "title": "TVL",
            "overtime-amm-tvl": "Overtime AMM TVL",
            "thales-amm-tvl": "Thales AMM TVL",
            "parlay-amm-tvl": "Parlay AMM TVL",
            "vaults-tvl": "Vaults TVL"
        }
    }
}
