{
    "common": {
        "read-more": "Read more",
        "show-less": "Show less",
        "max": "max",
        "save": "Save",
        "close": "Close",
        "no-data": "Do not have any data to show",
        "eg-val": "e.g. {{val}}",
        "select-date": "select date",
        "or": "or",
        "here": "here",
        "no-data-available": "No data available",
        "enter-amount": "Enter amount",
        "enter-percentage": "Enter percentage",
        "enter-address": "Enter address",
        "enter-minutes": "Enter minutes",
        "enter-hours": "Enter hours",
        "search-placeholder": "Search...",
        "progress": "Please wait...",
        "sort-menu": "Sorting menu",
        "on": "on",
        "in": "in",
        "and": "and",
        "asset": "Asset",
        "balance": "Balance",
        "result": "Result",
        "won": "Won",
        "loss": "Loss",
        "admin": "Admin",
        "liquidity": "Liquidity",
        "time-remaining": {
            "ended": "ended",
            "years": "years",
            "year": "year",
            "months": "months",
            "month": "month",
            "weeks": "weeks",
            "week": "week",
            "days": "days",
            "day": "day",
            "hours": "hours",
            "hour": "hour",
            "minutes": "minutes",
            "minute": "minute",
            "seconds": "seconds",
            "second": "second",
            "days-short": "d",
            "hours-short": "h",
            "minutes-short": "m",
            "seconds-short": "s",
            "months-short": "mo"
        },
        "transaction": {
            "view": "View",
            "successful": "Transaction successful"
        },
        "tx-status": {
            "pending": "Pending"
        },
        "wallet": {
            "connect-your-wallet": "Connect wallet",
            "wallet-options": "Wallet options",
            "disclaimer-info": "By connecting a wallet you agree to Thales DAO <terms>Terms of Use</terms> and Privacy Policy and acknowledge that you have read and understand the Thales DAO protocol <disclaimer>disclaimer</disclaimer>",
            "balance": "Wallet balance"
        },
        "errors": {
            "unknown-error-try-again": "An unknown error occurred after you submitted. Please try again.",
            "insufficient-balance": "Insufficient balance",
            "insufficient-staking-balance": "Insufficient staking balance",
            "out-of-liquidity": "Out of liquidity",
            "insufficient-liquidity": "Insufficient liquidity",
            "enter-amount": "Enter amount",
            "enter-address": "Enter address",
            "enter-slippage": "Enter slippage",
            "invalid-price": "Invalid price",
            "invalid-address": "Invalid address",
            "invalid-price-max": "The price cannot be higher than ${{max}}",
            "invalid-amount-max": "The amount cannot be higher than {{max}}",
            "insufficient-balance-wallet": "Please ensure your wallet has sufficient {{currencyKey}}",
            "invalid-slippage": "Invalid slippage",
            "max-limit-exceeded": "Amount exceeded the amount available on AMM",
            "user-rejected-tx": "User rejected transaction",
            "enter-percentage": "Enter percentage",
            "invalid-percentage-range": "The percentage must be between {{min}} and {{max}}"
        },
        "enable-wallet-access": {
            "approve": "Approve",
            "approve-progress": "Approving",
            "approve-label": "Approve {{currencyKey}}",
            "approve-progress-label": "Approving {{currencyKey}}...",
            "approve-all-label": "Approve all",
            "custom-amount-label": "Approve amount of",
            "approve-swap": "Approve swap to {{currencyKey}}"
        },
        "pagination": {
            "rows-per-page": "Rows per page:"
        },
        "unsupported-network": {
            "title": "Oops! You are on the wrong network!",
            "description": "You have selected the wrong network in your wallet. To continue, please switch to one of the supported networks.",
            "button": {
                "mainnet": "Switch to Mainnet",
                "optimism": "Switch to Optimism",
                "polygon": "Switch to Polygon",
                "arbitrum": "Switch to Arbitrum",
                "base": "Switch to Base"
            }
        },
        "status": {
            "success": "Success",
            "info": "Info",
            "warning": "Warning",
            "error": "Error"
        }
    },
    "home": {
        "thales": "Thales",
        "protocol": "Protocol",
        "protocol-description-1": "A permissionless ecosystem where every derivative market is a unique smart contract",
        "protocol-description-2": "Powered by pioneering AMM architecture and permissionless liquidity pools, any oracle provided pre-event probability data and post-event results data can be made into a tokenized derivative market by using the Thales Protocol architecture.",
        "total-protocol-volume": "Total protocol volume",
        "total-value-locked": "Total value locked",
        "total-unique-users": "Total unique users",
        "see-all-stats-button": "See All Stats",
        "ecosystem-apps": {
            "title": "Ecosystem apps",
            "thales-markets": "Digital Options marketplace built using Thales architecture. Thales Markets allows anyone to buy positions on crypto strike prices on specific dates. Any user can receive a fixed payout if a specific price condition is met at a specific expiry date. Choice of conditions vary from UP, DOWN, IN or OUT compared to chosen strike price(s).",
            "overtime": "Onchain Sports Markets Automated Market Maker (AMM) interface with integrated Parlay AMM architecture. Built on top of Thales Protocol technology, Overtime offers seamless user experience for all sports enthusiasts while bolstering transparent full collateralization at all times and permissionless security of the Ethereum network.",
            "spongly": "Spongly is Sports Markets dapp built on top of Thales' SportsAMM and ParlayAMM with a social twist. Take an opportunity to copy trade best sports traders, view individual wallets success rates and have a more detailed overview of all global parlay tickets. Use trading wisdom of the best to your own advantage!",
            "telegram": "By connecting Thales smart contracts to Telegram Bot trading interfaces, several new projects were born. These projects utilize simple trading experience within the easily accessible Telegram app to grow their userbase while leveraging the Thales collateral and onchain market making architecture to provide the backend.",
            "tale-of-thales": "Tale of Thales is a Metaverse minigame that takes you through retro pixel experience of an ancient Greek town of Miletus while teaching you how Thales Markets trading works. You can play the single-player or you can join the multiplayer metaverse, explore the infinity hotel, chat with other players or mint NFTs."
        },
        "investors": {
            "title": "Investors"
        },
        "integrations": {
            "title-link": "Tailored for Developers",
            "title": "Seamless Integration and Boundless Possibilities",
            "description": "To the developers poised to shape the future of simple derivatives trading: Thales is your canvas. Our protocol is meticulously designed to ensure that you have a frictionless experience in developing your applications with Thales infrastructure guaranteeing collateral liquidity, market making and security in the background. With comprehensive resources, including in-depth developer documentation, responsive tech support and a vibrant Discord community, Thales empowers you to realize your vision with precision and ease.",
            "thales-sports-markets-api-title": "Thales Sport Markets API",
            "thales-sports-markets-api-description": "Leverage the decentralization of the Ethereum network and it’s Smart Contracts for full collateralization and decentralization of a wide offering of global Sports Games Markets. By using Thales’ Sports API for SportsAMM and ParlayAMM integration, any developer can permissionlessly have access to a worlds most transparent and fair Sports Markets data with included cutting edge liquidity and trading infrastructure.",
            "thales-digital-options-api-title": "Thales Digital Options API",
            "thales-digital-options-api-description": "Thales Digital Options contracts provide integrators access to Automated Market Maker, on-demand liquidity and collateralization architecture for onchain Digital Options. With various supported assets ranging from crypto assets to commodities, anyone can integrate with ThalesAMM and RangedAMM contracts and provide it’s users simple-to-use and permissionless derivatives trading platform. Users can instantly place a position on whether the selected Asset Pricewill be UP or DOWN from selected Strike Price on selected Strike Date. Similarly, users can place IN or OUT positions on Price Ranges of the same Assets.",
            "thales-speed-markets-api-title": "Thales Speed Markets API",
            "thales-speed-markets-api-description": "Thales Speed Markets contracts is the newest Thales Protocol product that leverages Pyth Benchmark oracles to facilitate a front-running-free backend for fast intra-day digital options. Users of Thales Speed Markets contracts are able to speculate on the direction of a Crypto Asset price with custom market expiry that can go as short as 15 minutes. With a fixed potential return of +100% (minus the fees) for any type of open market and thus not needing a pricing algorithm, Thales SpeedMarketsAMM contract is super-lightweight and easy to integrate.",
            "integrate-with-thales-button": "Integrate with Thales"
        },
        "buying-selling": {
            "title": "Every Possible Outcome As An Erc20",
            "description-1": "Thales Protocol architecture tokenizes all unique positions as ERC20 tokens. Every market has a set of unique ERC20 token types that cover all potential exclusive outcomes of that market. These tokenized positions are minted by locking USD collateral in the designated Market Smart Contract. Each locked 1 USD mints 1 of each type of ERC20 tokenized positions. Only one type of these ERC20 positions can win on market expiry and only that type can claim the locked USD, while the losing ERC20 positions expire worthless. With this permissionless and automated architecture, Thales Protocol guarantees transparent and non-custodial full collateralization for all positions at all times.",
            "description-2": "With liquidity and collateralization solved, the next necessary step is pricing the minted positional ERC20 tokens and allowing for a good trading experience to the public. This is where the unique design of Thales Automated Market Maker comes into play. The Thales AMM contract is whitelisted to mint the ERC20 positions by locking the Liquidity Pool collateral funds in the designated market contracts. After minting, the AMM offers the ERC20 positional tokens on-demand to traders based on Algorithmic Probability Pricing that determines the fixed potential payout on market expiry.",
            "buying": {
                "title": "Buying a position example",
                "step-1": "ThalesAMM algorithmic probability pricing quotes BTC UP Options at $0.5 per Option",
                "step-2": "User wants to buy 1000 BTC UP tokens from the ThalesAMM for $500",
                "step-3": "ThalesAMM takes $1000 from the LP pool",
                "step-4": "ThalesAMM deposits $1000 to the Market Contract and mints 1000 BTC UP and 1000 BTC DOWN tokens from the Market Contract",
                "step-5": "ThalesAMM receives $500 from the User and sends 1000 BTC UP tokens to the User"
            },
            "selling": {
                "title": "Exercising a winning position example",
                "step-1": "Bitcoin price was above the Strike Price on the Maturity Date which means that User’s 1000 BTC UP positions are resolved as winning and every 1 BTC UP token is redeemable for $1 while BTC DOWN tokens are deemed worthless",
                "step-2": "User sends his 1000 BTC UP tokens to the Market Contract and claims the $1000 from the contract"
            }
        },
        "governance": {
            "title-link": "Community-Centric Governance",
            "title": "Steering the Future, Together",
            "description": "At Thales, we believe in the collective wisdom of our community. Our governance structure, underpinned by ThalesDAO and the Thales Council, is a testament to our commitment to decentralized decision-making. Every strategic move, every initiative, is guided by the voice of our community. Through a transparent and robust DAO voting mechanism, we ensure that Thales remains of the community, by the community, and for the community.",
            "explore-thales-dao-button": "Explore Thales DAO"
        },
        "timeline": {
            "title": "Timeline"
        },
        "infrastructure": {
            "title": "Infrastructure Partners"
        }
    },
    "staking": {
        "nav": {
            "rewards": "Rewards",
            "staking": "Staking",
            "vesting": "Vesting",
            "leaderboard": "Leaderboard",
            "acc-preferences": "Acc Preferences",
            "lp-staking": "AMM LP"
        },
        "table": {
            "title": "Your activity",
            "date-time-col": "Date | Time",
            "type-col": "Type",
            "amount-col": "Amount",
            "tx-status-col": "TX Status",
            "no-results": {
                "all": "No transactions associated with this wallet.",
                "claimRetroAirdrop": "No retro airdrop transactions associated with this wallet.",
                "claimRetroUnlocked": "No retro unlocked transactions associated with this wallet.",
                "claimStakingRewards": "No staking rewards transactions associated with this wallet.",
                "claimMigratedRewards": "No migrated rewards transactions associated with this wallet.",
                "claimMigratedRetroRewards": "No migrated retro rewards transactions associated with this wallet.",
                "stake": "No stake transactions associated with this wallet.",
                "startUnstake": "No start unstaking transactions associated with this wallet.",
                "cancelUnstake": "No cancel unstaking transactions associated with this wallet.",
                "unstake": "No unstake transactions associated with this wallet.",
                "addToEscrow": "No add to escrow transactions associated with this wallet.",
                "vest": "No vest transactions associated with this wallet.",
                "lpStake": "No LP stake transactions associated with this wallet.",
                "lpUnstake": "No LP unstake transactions associated with this wallet.",
                "lpClaimStakingRewards": "No LP staking rewards transactions associated with this wallet.",
                "mergeAccount": "No merge account transactions associated with this wallet.",
                "delegateVolume": "No delegate volume transactions associated with this wallet.",
                "removeDelegation": "No remove delegation transactions associated with this wallet."
            },
            "types": {
                "claimRetroAirdrop": "Claim retro airdrop",
                "claimRetroUnlocked": "Claim retro unlock",
                "claimStakingRewards": "Claim staking rewards",
                "claimMigratedRewards": "Claim migrated rewards",
                "claimMigratedRetroRewards": "Claim migrated retro rewards",
                "stake": "Stake",
                "startUnstake": "Start unstaking",
                "cancelUnstake": "Cancel unstaking",
                "unstake": "Unstake",
                "addToEscrow": "Add to escrow",
                "vest": "Vest",
                "lpStake": "LP stake",
                "lpUnstake": "LP unstake",
                "lpClaimStakingRewards": "Claim LP staking rewards",
                "mergeAccount": "Merge account",
                "delegateVolume": "Delegate Volume",
                "removeDelegation": "Remove Delegation"
            },
            "filter": {
                "button": "Filter",
                "all": "All",
                "claimRetroAirdrop": "Retro airdrop",
                "claimRetroUnlocked": "Retro unlock",
                "claimStakingRewards": "Reward claims",
                "claimMigratedRewards": "Migrated rewards",
                "claimMigratedRetroRewards": "Migrated retro rewards",
                "stake": "Stake",
                "startUnstake": "Start unstaking",
                "cancelUnstake": "Cancel unstaking",
                "unstake": "Unstake",
                "addToEscrow": "Add to escrow",
                "vest": "Vest",
                "lpStake": "LP stake",
                "lpUnstake": "LP unstake",
                "lpClaimStakingRewards": "LP staking rewards",
                "mergeAccount": "Merge account",
                "delegateVolume": "Delegate Volume",
                "removeDelegation": "Remove Delegation"
            }
        },
        "rewards": {
            "how-it-works": {
                "title": "How Gamified Staking Rewards Work?",
                "every-week-description": "<span>Every week</span> THALES token holders earn staking rewards. The amount you earn depends on the percentage of THALES you've staked during the weekly snapshot. If you don't claim these rewards within a week, they expire.",
                "each-week-description": "<span>Each week:</span> <br /> • 45,000 THALES are divided among all stakers. <br /> • An extra 15,000 THALES are given to active stakers who trade, deposit in pools, or use vaults on Thales and Overtime platforms.",
                "how-points-are-earned": "<span>How points are earned:</span> <br />• <span>Trading:</span> For every <span>$1</span> traded on Thales or Overtime, you earn <span>1 point</span>. <br />• <span>Liquidity</span> Pools: Deposit <span>$1</span> into any Thales liquidity pool and earn <span>0.1 points</span>. <br />• <span>Vaults:</span> Deposit <span>$1</span> into any Thales vault and earn <span>0.2 points</span>.",
                "multiplier-description": "The more THALES you stake, the more your points multiply, up to 2x. <br /> Your total points determine your share of the 15,000 THALES bonus.",
                "final-points": "Final Points = (Trading + Pool + Vault points) x THALES Multiplier"
            },
            "claim": {
                "title": "Your Current Claimable Rewards",
                "time-left": "Time left to claim : ",
                "gamified-staking-rewards": "Gamified Staking Rewards",
                "base-rewards": "Base Rewards",
                "disclaimer": "Unclaimed weekly rewards are forfeited!",
                "claim-rewards": "Claim Rewards",
                "claiming": "Claiming"
            },
            "base-rewards": {
                "title": "Base staking rewards & Multiplier",
                "current-multiplier": "Your current multiplier : ",
                "your-staked": "Your THALES staked",
                "staking-divider": "Staking Divider",
                "total-staked": "Total THALES staked",
                "staked-share": "Your Staked Share"
            },
            "your-rewards": {
                "title": "Your Points Reward",
                "current-points": "Your current points : ",
                "trading-volume": "Trading Volume",
                "amm-lp-balances": "AMM LP balances",
                "vaults-balances": "Vaults balances",
                "trading-multiplier": "Trading multiplier",
                "lp-multiplier": "LP multiplier",
                "vaults-multiplier": "Vaults multiplier",
                "points": "Points"
            }
        },
        "staking": {
            "staking-data": {
                "title": "Staking data",
                "my-staking-share": "My Staking Share",
                "estimated-rewards": "Estimated Rewards",
                "for-date": "For date"
            },
            "my-balance": {
                "title": "My staking balance",
                "staked-directly": "Staked directly",
                "escrowed-balance": "Escrowed balance"
            },
            "stake-unstake": {
                "stake": "stake",
                "staking": "staking",
                "unstake": "unstake",
                "unstaking": "unstaking",
                "amount-to": "Amount to",
                "stake-success": "Tokens successfully staked",
                "paused-message": "Staking is paused.",
                "cooldown-confirmation-message": "Unstaking successfully started",
                "unstake-confirmation-message": "Tokens successfully unstaked",
                "cancel": "Cancel unstaking",
                "canceling": "Canceling unstaking",
                "start-unstaking-tooltip": "During the unstaking cooldown you will not be able to stake or unstake more THALES.",
                "unlock-cooldown-text": "Unlocking starts a cooldown period during which the amount of THALES unstaked isn't counted in your staked balance.",
                "cooldown-started-text": "You can unstake {{amount}} in",
                "cooldown-ended-text": "You can now unstake {{amount}}",
                "cooldown-label": "Cooldown",
                "start-unstaking": "Start unstaking",
                "amount-to-unstake": "Amount to unstake",
                "user-lping-message": "You cannot unstake while providing liquidity for Thales or Overtime."
            }
        },
        "vesting": {
            "title": "Available to vest",
            "vest": "Vest",
            "description": "Vest your THALES staking rewards in escrow. THALES ongoing rewards are subject to 10 weeks vesting. Escrowed THALES is calculated in your staked THALES balance.",
            "vested-until": "Vested until"
        },
        "leaderboard": {
            "time-left": {
                "title": "Time left in round",
                "points-for": "Points for 1 THALES",
                "multiplier": "Multiplier",
                "total-points": "Total points",
                "description": "Leaderboard for current round is based on estimations of current user balances across LP pools and vaults. Actual points are determined when rounds close.",
                "round": "Round"
            },
            "breakdown": {
                "trading": "Trading",
                "amm-lp": "AMM LP",
                "vaults": "Vaults",
                "volume": "Volume",
                "multiplier": "Multiplier",
                "points": "Points"
            }
        },
        "acc-preferences": {
            "delegate": {
                "title": "Delegate volume",
                "subtitle": "HOW DELEGATE VOLUME WORKS",
                "description-1": "The \"Delegate Volume\" functionality gives you the ability to direct the volume generated from one wallet that you own to another wallet. This simple step comes in handy for those who stake their THALES with a hardware wallet but do their trading on another hot wallet for convenience's sake (for example using Overtime on their mobile wallet), this way the volume generated can count towards the \"Protocol Volume bucket\" of gamified THALES staking rewards.",
                "description-2": "This delegation of volume can be stopped at any time and it has checks in place to avoid a wallet directing it's volume to another while still boosting it's own."
            },
            "merge": {
                "title": "Merge account",
                "subtitle": "HOW MERGE ACCOUNT WORKS",
                "description-1": "The \"Merge Account\" functionality gives a THALES staker the ability to transfer all its staked THALES and staking rewards from one wallet to another. This comes in handy for those who want to cycle wallets or for those whose wallet has been compromised.",
                "description-2": "This account merging only works for the entire balance of staked and vested THALES, partial reassignments will not be possible. It's also worth noting that on the receiving wallet, the THALES tokens staked will still need a 7-day countdown to unstake and the vested rewards will also be subject to the standard 10-weeks cooldown when claiming."
            },
            "claim": {
                "title": "Claim on Behalf",
                "subtitle": "Enter account for which you want to enable / disable claim on your behalf",
                "description": "Claim on behalf has been implemented per TIP-66. Please check this guid on how to automate your weekly claims.",
                "enabled-accounts-subtitle": "Accounts that are enabled to claim on your behalf",
                "button": "Enter address"
            },
            "source": "Source",
            "destination": "Destination",
            "delegate-button": "Delegate"
        }
    },
    "header": {
        "links": {
            "dashboard": "Dashboard",
            "staking": "Staking",
            "governance": "Governance",
            "docs": "Docs",
            "whitepaper": "Whitepaper"
        }
    },
    "footer": {
        "discord": "Discord",
        "github": "Github",
        "twitter": "X",
        "docs": "Docs",
        "medium": "Medium"
    },
    "dashboard": {
        "ecosystem": "Ecosystem",
        "networks": "Networks",
        "governance": {
            "title": "Governance",
            "start-date": "Start date",
            "end-date": "End date"
        },
        "integrators": {
            "title": "Integrators volume",
            "total-volume": "Total volume"
        },
        "protocol-volume": {
            "total-protocol-volume": "Total protocol volume",
            "safebox-fees": "Safebox fees",
            "thales-amm": "Thales AMM",
            "overtime-amm": "Overtime AMM",
            "parlay-amm": "Parlay AMM",
            "average-unique-users": "AVG unique users",
            "average-monthly-users": "AVG monthly users"
        },
        "staking": {
            "title": "Staking",
            "total-stakers": "Total Stakers",
            "total-thales-staked": "Total Thales staked",
            "of-circulating-supply": "Of circulating supply",
            "of-total-supply": "Of total supply",
            "staked-on-arbitrum": "Staked on Arbitrum",
            "staked-on-optimism": "Staked on Optimism",
            "staked-on-base": "Staked on Base"
        },
        "token-addresses": {
            "title": "Thales token",
            "bridge": "Bridge",
            "optimism": "Optimism",
            "arbitrum": "Arbitrum",
            "base": "Base",
            "mainnet": "Mainnet"
        },
        "token-burn": {
            "title": "Thales token burn",
            "total-thales-burned": "Total Thales burned",
            "of-circulating-supply": "Of circulating supply",
            "of-total-supply": "Of total supply"
        },
        "token-info": {
            "title": "Thales token info",
            "total-supply": "Total supply",
            "circulating-supply": "Circulating supply",
            "burned-supply": "Burned supply"
        },
        "tvl": {
            "title": "TVL",
            "overtime-amm-tvl": "Overtime AMM TVL",
            "thales-amm-tvl": "Thales AMM TVL",
            "parlay-amm-tvl": "Parlay AMM TVL",
            "vaults-tvl": "Vaults TVL"
        }
    }
}
